
# 数据
data = [13, 15, 16, 16, 19, 20, 20, 21, 22, 22, 25,
        25, 25, 25, 30, 33, 33, 35, 35, 35, 35, 36, 40, 45, 46, 52, 70]

# 极值
max_v = 70
min_v = 13
avg_v = 29.96
# 标准差
std_v = 12.94

vi = 35

# 题目a
new_max_v = 1.0
new_min_v = 0.0
vi = ((vi-min_v)/(max_v - min_v))*(new_max_v - new_min_v) + new_min_v
vi = ((35 - 13)/(70-13))*(1.0-0.0)+0.0
vi = 0.386

# 题目b

vi = (vi-avg_v)/std_v
vi = (35 - 29.96)/12.94
vi = 0.389
print(vi)

# 题目c
# 有公式 vi' = vi / 10 ^ j
# 其中 j  为使得 max(|vi'|) < 1 成立的最小整数
# 由于 vi = 35,所有j = 2
# 小数定标规范化后
vi = 0.35
