# 题目说明：

# 对数据

data = [13, 15, 16, 16, 19, 20, 20, 21, 22, 22, 25,

        25, 25, 25, 30, 33, 33, 35, 35, 35, 35, 36, 40, 45, 46, 52, 70]

# 使用深度为3的箱， 用箱均值光滑以上数据


# 设置权重为3

weight = 3


# 分箱后


data1 = [13, 15, 16]

data2 = [16, 19, 20]

data3 = [20, 20, 21]

data4 = [20, 21, 22]

data5 = [25, 25, 25]

data6 = [25, 30, 33]

data7 = [33, 35, 35]

data8 = [36, 40, 45]

data9 = [46, 52, 70]


# 使用箱平均值光滑后的数据

data1 = [14.67, 14.67, 14.67]

data2 = [18.32, 18.32, 18.32]

data3 = [20.32, 20.32, 20.32]

data4 = [21.0, 21.0, 21.0]

data5 = [25.0, 25.0, 25.0]

data6 = [29.32, 29.32, 29.32]

data7 = [34.36, 34.36, 34.36]

data8 = [40.36, 40.36, 40.36]

data9 = [56.0, 56.0, 56.0]


# 步骤说明

# 1、按题目要求设置权重；

# 2、将原始数据进行递增排序；

# 3、按照每个箱子3个数据，将原始数据划分进9个箱子中；

# 4、计算每个箱子内数据的平均值，并将其平均值填充进其中。
